app/controllers/api/v1/auth/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(email) = 'test@fintoc.com') ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"
UPDATE "users" SET "updated_at" = '2026-01-26 01:29:11.768656', "magic_link_token" = 'FAjx7LjugRTeGQEESCtS3BvF3yE_uw2UnXZIpjbD1NE', "magic_link_sent_at" = '2026-01-26 01:29:11.767427' WHERE "users"."id" = '7ce9e54a-69e0-423b-b490-297d7e47be40'
INSERT INTO "users" ("email", "password_digest", "name", "avatar_url", "timezone", "created_at", "updated_at", "role", "magic_link_token", "magic_link_sent_at") VALUES ('test@fintoc.com', NULL, 'test@fintoc.com', NULL, 'UTC', '2026-01-26 01:29:11.764175', '2026-01-26 01:29:11.764175', 'member', NULL, NULL) RETURNING "id"
---
        def send_magic_link
          email = params[:email]&.downcase&.strip

          if email.blank? || !email.match?(URI::MailTo::EMAIL_REGEXP)
            return render json: { error: "Please provide a valid email address" }, status: :unprocessable_entity
          end

          unless fintoc_email?(email)
            return render json: { error: "Only @fintoc.com email addresses are allowed" },
                          status: :unprocessable_entity
          end

          user = User.find_by_email(email)

          if user.nil?
            # Create new user - first user becomes owner
            is_first_user = User.count.zero?
            user = User.new(
              email: email,
              name: email,
              role: is_first_user ? "owner" : "member"
            )

            unless user.save

SELECT "users".* FROM "users" WHERE "users"."magic_link_token" = 'GHTbNmFi7sMfmQ83ZVRSbw6FFIzNQxpsVZiSALcgUTY' LIMIT 1
---
        def verify_magic_link
          token = params[:token]

          if token.blank?
            return render json: { error: "Token is required" }, status: :unprocessable_entity
          end

          user = User.find_by_magic_link_token(token)