app/controllers/api/v1/issues_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."team_id" = '901d5d92-a0f2-43cc-a4aa-1e4f96506d1a' ORDER BY "issues"."created_at" DESC
SELECT "teams".* FROM "teams" WHERE "teams"."id" = '901d5d92-a0f2-43cc-a4aa-1e4f96506d1a'
---
      def index
        issues = Issue.includes(:creator, :assignee, :team, :project, :labels, :workflow_state)

        # Filter by team
        issues = issues.by_team(params[:team_id]) if params[:team_id].present?

        # Filter by project
        issues = issues.by_project(params[:project_id]) if params[:project_id].present?

        # Filter by assignee
        if params[:assignee_id].present?
          issues = params[:assignee_id] == "unassigned" ? issues.unassigned : issues.by_assignee(params[:assignee_id])
        end

        # Filter by status
        issues = issues.where(status: params[:status]) if params[:status].present?

        # Filter by workflow_state
        issues = issues.where(workflow_state_id: params[:workflow_state_id]) if params[:workflow_state_id].present?

        # Filter by cycle
        issues = issues.where(cycle_id: params[:cycle_id]) if params[:cycle_id].present?

        # Filter by priority
        issues = issues.by_priority(params[:priority]) if params[:priority].present?

        # Filter for my issues
        issues = issues.by_assignee(current_user.id) if params[:my_issues] == "true"

        # Search
        issues = issues.search(params[:q]) if params[:q].present?

SELECT "teams".* FROM "teams" WHERE "teams"."id" = '9f31461f-5b5b-4c34-bacb-4729964f109d' LIMIT 1
INSERT INTO "issues" ("team_id", "creator_id", "assignee_id", "project_id", "parent_id", "identifier", "number", "title", "description", "description_html", "status", "priority", "due_date", "estimate", "sort_order", "started_at", "completed_at", "canceled_at", "archived_at", "search_vector", "created_at", "updated_at") VALUES ('9f31461f-5b5b-4c34-bacb-4729964f109d', '7ce9e54a-69e0-423b-b490-297d7e47be40', '7ce9e54a-69e0-423b-b490-297d7e47be40', NULL, NULL, 'DES-1', 1, 'arreglar problema', '1', NULL, 'in_progress', 1, '2026-01-25', NULL, 0, NULL, NULL, NULL, NULL, NULL, '2026-01-26 01:51:45.156555', '2026-01-26 01:51:45.156555') RETURNING "id"
---
      def create
        team = Team.find_by!(id: params[:team_id])
        issue = team.issues.new(issue_params)
        issue.creator = current_user

        if issue.save

SELECT "labels".* FROM "labels" INNER JOIN "issue_labels" ON "labels"."id" = "issue_labels"."label_id" WHERE "issue_labels"."issue_id" = 'd4087c71-7a7e-4f9b-a906-454208bd4054'
---
      def set_issue
        @issue = Issue.includes(
          :creator, :assignee, :team, :project, :labels,
          :workflow_state, :cycle, :attachments,
          sub_issues: [:assignee, :workflow_state],
          parent: [:assignee, :workflow_state]
        ).find(params[:id])