app/controllers/api/v1/projects_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = '901d5d92-a0f2-43cc-a4aa-1e4f96506d1a'
---
      def index
        projects = Project.includes(:lead, :members, :teams).ordered

        # Filter by team if provided
        if params[:team_id].present?
          team_project_ids = ProjectTeam.where(team_id: params[:team_id]).select(:project_id)
          projects = projects.where(id: team_project_ids)