app/controllers/api/v1/teams_controller.rb

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."team_id" IN ('9f31461f-5b5b-4c34-bacb-4729964f109d', '901d5d92-a0f2-43cc-a4aa-1e4f96506d1a')
---
      def index
        teams = Team.includes(:team_memberships, :members).ordered

INSERT INTO "teams" ("name", "key", "description", "icon", "color", "issue_counter", "settings", "created_at", "updated_at") VALUES ('Test Team', 'TST', NULL, NULL, 'blue', 0, '{}', '2026-01-26 01:45:28.207407', '2026-01-26 01:45:28.207407') RETURNING "id"
INSERT INTO "team_memberships" ("user_id", "team_id", "role", "created_at", "updated_at") VALUES ('7ce9e54a-69e0-423b-b490-297d7e47be40', '2775f5a1-a921-481e-97da-41d28b861063', 'lead', '2026-01-26 01:45:28.216244', '2026-01-26 01:45:28.216244') RETURNING "id"
---
      def create
        team = Team.new(team_params)

        if team.save
          # Add current user as team lead by default
          TeamMembership.create!(user: current_user, team: team, role: "lead")