app/models/user.rb

SELECT "users".* FROM "users" WHERE (LOWER(email) = 'test@fintoc.com') ORDER BY "users"."id" ASC LIMIT 1
---
  def self.find_by_email(email)
    by_email(email).first

SELECT 1 AS one FROM "users" WHERE "users"."magic_link_token" = 'FAjx7LjugRTeGQEESCtS3BvF3yE_uw2UnXZIpjbD1NE' LIMIT 1
---
  def generate_magic_link_token!
    loop do
      self.magic_link_token = SecureRandom.urlsafe_base64(32)
      break unless User.exists?(magic_link_token: magic_link_token)

SELECT "users".* FROM "users" WHERE "users"."magic_link_token" = 'GHTbNmFi7sMfmQ83ZVRSbw6FFIzNQxpsVZiSALcgUTY' LIMIT 1
---
  def self.find_by_magic_link_token(token)